src/Catalogs/ОграниченияДоступаККонтурамАдминистрирования/ОграниченияДоступаККонтурамАдминистрирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОграниченияДоступаККонтурамАдминистрирования</name>
  <tabularSections>
    <name>ПользователиИБ</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеКонтуры</name>
    <attributes>
      <name>Контур</name>
      <type>
        <types>CatalogRef.КонтурыАдминистрирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/РаботаСоСценариямиАвтоматизацииПовторноеИспользование/Module.bsl
Функция ПолучитьСписокОграниченийДляТекущегоПользователя() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ОграниченияДоступаККонтурамАвтоматизацииДоступныеКонтурыАвтоматизации.Контур КАК Контур
	                      |ИЗ
	                      |	Справочник.ОграниченияДоступаККонтурамАдминистрирования.ДоступныеКонтуры КАК ОграниченияДоступаККонтурамАвтоматизацииДоступныеКонтурыАвтоматизации
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОграниченияДоступаККонтурамАдминистрирования.ПользователиИБ КАК ОграниченияДоступаККонтурамАвтоматизацииПользователиИБ
	                      |		ПО ОграниченияДоступаККонтурамАвтоматизацииДоступныеКонтурыАвтоматизации.Ссылка = ОграниченияДоступаККонтурамАвтоматизацииПользователиИБ.Ссылка
	                      |ГДЕ
	                      |	ОграниченияДоступаККонтурамАвтоматизацииПользователиИБ.Имя = &Имя
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Контур");
	Запрос.УстановитьПараметр("Имя", ТекущийПользователь.Имя);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Новый ФиксированныйМассив(Результат.ВыгрузитьКолонку("Контур"));
КонецФункции
